2023.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>2023</title>
<meta name="generator" content="Org mode">
<meta name="description" content="September is 9th month of the year. Yet Sept means 7. Weird."
>
<meta name="keywords" content="microblog, 2023">
<link rel='stylesheet' href='./css/code.css' />
<link rel='stylesheet' href='./css/simple.css' />
<link rel='shortcut icon' href='./img/favicon.ico' type='image/x-icon' />
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/fork-awesome@1.2.0/css/fork-awesome.min.css' integrity='sha256-XoaMnoYC5TH6/+ihMEnospgm0J1PM/nioxbOUdnM8HY=' crossorigin='anonymous'>
</head>
<body>
<header id="top" class="status">
<a href="./index.html">shrirambo</a>.<a href="https://github.com/shrirambo">github</a>.<a href="">io</a>/<a href="./index.html">home</a>/<a href="./index.html">blog</a>
</header>
<main id="content">
<h1 class="title">2023</h1>
<hr>

<section id="outline-container-orgbc090a2" class="outline-2">
<h2 id="orgbc090a2"><a href="#orgbc090a2">🎲 Intransitive dice</a></h2>
<div class="outline-text-2" id="text-orgbc090a2">
<p>
When one says that they prefers icecream over doughnut and a doughnut over a chocolat bar, it goes without saying that they prefer icecream over a chocolate bar. If they are a rational being. This is transitive nature. But if I say that I have a set of 3 defective dice such that the first one rolls a higher number than the second one more often than not. And the second one rolls a higher number than the third one more often than not. And the third one also rolls a higher number than the first one more often than not. Say what?? These are known as intransitive dice. Here is an example
</p>

<ul class="org-ul">
<li>D1: 1, 1, 3, 5, 5, 6</li>
<li>D2: 2, 3, 3, 4, 4, 5</li>
<li><p>
D3: 1, 2, 2, 4, 6, 6
</p>

<p>
Check it out for yourself. <a href="https://en.wikipedia.org/wiki/Intransitive_dice">Wikipedia: Intransitive dice</a>
</p></li>
</ul>
</div>
</section>

<section id="outline-container-orgaa18023" class="outline-2">
<h2 id="orgaa18023"><a href="#orgaa18023">🍄 Idempotence</a></h2>
<div class="outline-text-2" id="text-orgaa18023">
<p>
Today I learned the concept of Idempotency, a property of set of mathematical operations that yields the same output as when applied first time. For example, consider the operation of multiplication by zero. No matter how many times you multiply a number by zero, the result is same as the first time you multiplied it. More practical example would be the elevator button. It doesn't matter if you press it once or a thousand time.
</p>

<p>
This property is useful when designing APIs for which the operations are expected to carry out only once irrespective of how many times requested. This allows carrying out heavy computations or modify data only once, even if multiple requests are made with same sets of parameters.
</p>
</div>
</section>


<section id="outline-container-org9f77090" class="outline-2">
<h2 id="org9f77090"><a href="#org9f77090">💲 Million dollar idea</a></h2>
<div class="outline-text-2" id="text-org9f77090">
<p>
I had a world class Idea today, to create my own microblog, that no one will ever read. Made with Emacs Orgmode and published as a static page. Please give me a million dollars :)
</p>
</div>
</section>
</main>
<footer id="postamble" class="status">
<hr>
<section>
<script src="https://giscus.app/client.js" 
  data-repo="ShriRambo/giscus-comments"
  data-repo-id="R_kgDOG1mtrQ"
  data-category="Announcements" 
  data-category-id="DIC_kwDOG1mtrc4CBJNW" 
  data-mapping="title" 
  data-reactions-enabled="1" 
  data-emit-metadata="0" 
  data-input-position="top" 
  data-theme="dark" 
  data-lang="en" 
  crossorigin="anonymous" 
  async> </script>
</section>
<hr>
<section>
  <p style="text-align:center">
Made with ❤️ and Emacs (Org-mode)
</p>
<div align=center>
  <a href="#" class='link-icon'>
    <i class="fa fa-home fa-lg" aria-hidden="true"></i>
  </a>
  <a href="https://www.instagram.com/shrirambo/" class='link-icon'>
    <i class="fa fa-instagram fa-lg" aria-hidden="true"></i>
  </a>
  <a href="https://github.com/shrirambo" class='link-icon'>
    <i class="fa fa-github fa-lg" aria-hidden="true"></i>
  </a>
  <a href='https://www.linkedin.com/in/shriram-ashirgade/' class='link-icon'>
    <i class="fa fa-linkedin-square fa-lg" aria-hidden="true"></i>
  </a>
  <a href='https://social.vivaldi.net/@shrirambo'>
    <i class="fa fa-mastodon fa-lg" aria-hidden="true"></i>
  </a>
  <a href='https://github.com/ShriRambo/sturdy-octo-winner/tree/master/content' class='link-icon'>
    <i class="fa fa-code  fa-lg" aria-hidden="true"></i>
  </a>
  <a href='#content' class='link-icon'>
    <i class="fa fa-hand-o-up  fa-lg" aria-hidden="true"></i>
  </a>
</div>
</div>
</footer>
</body>
</html>
